import com.rubikslab.digitalfiling.Subject
import com.rubikslab.digitalfiling.Utils

class BootStrap {

    def init = { servletContext ->
        def subjectNames = ["অডিট আপত্তি/অর্থ আত্মসাৎ/আর্থিক ক্ষতি/মালামাল আত্মসাৎ/অডিট প্রতিবেদন",
                "অর্থ/অগ্রীম/তহবিল সংক্রান্ত/ব্যয় সংক্রান্ত যাবতীয় বিষয়/হিসাবরক্ষণ অফিস/ব্যাংক সংক্রান্ত কার্যক্রম",
                "অনিষ্পন্ন বিষয়ের তালিকা প্রণয়ন",
                "আইনগত/মামলা পরিচালনা কার্যক্রম গ্রহণ সংক্রান্ত বিষয়াদি",
                "কর্মবন্টন/কর্ম পরিকল্পনা/পরিকল্পনা প্রণয়ন",
                "কার্যবিবরনী/মাসিক সমন্বয় সভা/বিশেষ সভা/নিয়মিত অন্যান্য সভা/কমিটি গঠন/কমিটির নিয়মিত সভা/বিবরনী",
                "ক্রয় প্রক্রিয়াকরণ/টেন্ডার সংক্রান্ত যাবতীয় বিষয়/ঠিকাদার তালিকাভূক্তি/ঠিকাদারদের অভিযোগ বা জামানত সংক্রান্ত যাবতীয় বিষয়",
                "ছুটি সংক্রান্ত যাবতীয় বিষয়/কর্মচারীদের হাজিরা বিবরণী",
                "জাতীয় সংসদে প্রশ্নোত্তর/মুলতুবি প্রস্তাব/অন্যান্য সংসদ বিষয়ক কার্যক্রম",
                "টেলিফোন প্রাপ্যতা/সংযোগ সংক্রান্ত যাবতীয় কার্যক্রম/টেলিফোন বিল",
                "নিয়োগ সংক্রান্ত সকল কার্যক্রম",
                "পদোন্নতি সংক্রান্ত যাবতীয় কার্যক্রম/দক্ষতা সীমা কিংবা সিলেকশন গ্রেড সংক্রান্ত সকল কার্যক্রম",
                "পেনশন সংক্রান্ত সকল কার্যক্রম/কল্যান তহবিল/সাধারণ ভবিষ্যত তহবিল",
                "প্রকল্প প্রনয়ন/উন্নয়ন প্রকল্প সংক্রান্ত/প্রকল্প বাস্তবায়ন/প্রকল্প অনুমোদন",
                "প্রকল্প থেকে রাজস্ব খাতে স্থানান্তর/পদ সৃষ্টি/সংরক্ষন/আত্তীকরণ/উদ্বৃত্ত ঘোষনা",
                "প্রতিবেদন প্রেরণ/সংরক্ষণ/সংগ্রহ সংক্রান্ত",
                "প্রেসনোট/পেপার কাটিং এর উপর কার্যক্রম/প্রতিবাদলিপি/বিজ্ঞাপন",
                "প্রশাসনিক কার্যক্রম/মন্ত্রনালয়ের/অধিদপ্তরের অভ্যন্তরীণ অফিস আদেশ/সংস্থাপন",
                "বদলি/পদায়ন/প্রেষণ/দায়িত্ব হস্তান্তর সংক্রান্ত সকল কার্যক্রম",
                "বাজেট প্রনয়ণ/বাজেট বরাদ্দ সংক্রান্ত কার্যক্রম/প্রাক্কলন",
                "বার্ষিক গোপনীয় প্রতিবেদন প্রেরণ/সংরক্ষণ/এসিআর সংক্রান্ত সকল কার্যক্রম/ব্যক্তিগত নথি/অতি গোপনীয় নথি",
                "বিধি/আইন/নীতি প্রণয়ন বা সংশোধন বা ব্যাখ্যা বা পরিমার্জন বা বিলুপ্তি",
                "বিভিন্ন দিবস/মাস উদযাপন/পুরস্কার বিতরন/উদযাপন সংক্রান্ত যাবতীয় বিষয়",
                "বৈদেশিক সাহায্য/বৈদেশিক যোগাযোগ/দাতা সংস্থার সাথে যোগাযোগ ইত্যাদি বিষয়াদি/দাতা সংস্থা",
                "ভ্রমন/প্রশিক্ষণ সংক্রান্ত যাবতীয় বিষয়",
                "যানবাহন ক্রয়/রক্ষণাবেক্ষণ/জ্বালানি/মেরামত/যানবাহন/মটর সাইকেল সংক্রান্ত যাবতীয় কার্যক্রম",
                "শৃঙ্খলা/অভিযোগ/তদন্ত/আপিল/রিভিউ সংক্রান্ত কার্যক্রম/কারন দর্শানো",
                "সাংগঠনিক কাঠামো অনুমোদন/অন্তর্ভুক্তকরন/বিলুপ্তকরন সংক্রান্ত যাবতীয় কার্যক্রম",
                "সেমিনার/ওয়ার্কশপ দেশের অভ্যন্তরে আয়োজন/ব্যবস্থাপনা",
                "স্টেশনারি সামগ্রীর চাহিদাপত্র/মালামাল সংগ্রহ ও সরবরাহ/অকেজো মালামাল বিক্রয়/মালামাল সংক্রান্ত যাবতীয় বিষয়াদি",
                "অফিস/বাসা বরাদ্দ/অফিস/বাসা/গোডাউন মেরামত বা নির্মান সংক্রান্ত যাবতীয় বিষয়াদি",
                "জমি গ্রহন/অধিগ্রহন/ভূমি সংক্রান্ত যাবতীয় কার্যক্রম",
                "বিদ্যুৎ/গ্যাস/পানি সংক্রান্ত/যাবতীয় ইউটিলিটি বিল/পৌরকর পরিশোধ সংক্রান্ত",
                "প্রাকৃতিক দূর্যোগ সংক্রান্ত সকল কার্যক্রম",
                "পুরাতন নথি",
                "বিবিধ"]
        int code = 1;
        for (def subjectName : subjectNames) {
            if (code == 5) break
            new Subject(name: subjectName, code: Utils.engToBengaliNumber(String.format('%02d', code++))).save()
        }
    }
    def destroy = {
    }
}
